{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 2], "units": 5, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.2"}