{"config": [{"config": {"batch_input_shape": [null, 6], "units": 12, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "dtype": "float32", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"units": 6, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"units": 1, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}