{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_1", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "units": 16, "kernel_regularizer": null, "batch_input_shape": [null, 32]}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "sigmoid", "units": 16}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "sigmoid", "units": 16}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "sigmoid", "units": 8}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_5", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "softmax", "units": 3}}], "backend": "tensorflow", "keras_version": "2.1.2"}