{"config": [{"config": {"kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "batch_input_shape": [null, 2], "activation": "sigmoid", "kernel_regularizer": null, "name": "dense_1", "dtype": "float32", "use_bias": true, "units": 5}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.2", "backend": "tensorflow"}