{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"units": 1, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 2], "kernel_regularizer": null, "activation": "sigmoid"}}]}