{"config": [{"config": {"activation": "sigmoid", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activity_regularizer": null, "batch_input_shape": [null, 14], "trainable": true, "kernel_regularizer": null, "units": 14, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 7, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.2", "backend": "tensorflow"}