{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "batch_input_shape": [null, 4], "activation": "sigmoid", "name": "dense_1", "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow", "keras_version": "2.1.2"}