{"keras_version": "2.1.2", "config": [{"class_name": "Dense", "config": {"activation": "sigmoid", "use_bias": true, "units": 1, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "class_name": "Sequential", "backend": "tensorflow"}