{"config": [{"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "units": 10, "activation": "sigmoid", "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 10, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 10, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 5, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_4", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 1, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_5", "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.2"}