{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "units": 12, "trainable": true, "batch_input_shape": [null, 6], "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "units": 6, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "use_bias": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "name": "dense_3", "use_bias": true}}], "keras_version": "2.1.2"}